{"l1": {"president": {"sentence": "The president of the company made an announcement about the new product launch.", "note": "111"}, "manager": {"sentence": "The manager supervised the employees and ensured that the project was completed on time.", "note": "第二題"}, "director": {"sentence": "The director directed the actors on the set to bring the scene to life.", "note": ""}, "supervisor": {"sentence": "The supervisor oversaw the assembly line to ensure that the workers were safe and efficient.", "note": ""}, "leader": {"sentence": "The leader inspired the team to work hard and achieve their goals.", "note": ""}, "receptionist": {"sentence": "The receptionist greeted the visitors and directed them to the correct department.", "note": ""}, "representative": {"sentence": "The representative presented the company's new product to the potential clients.", "note": ""}, "porter": {"sentence": "The porter helped the guests carry their luggage to their room.", "note": ""}, "secretary": {"sentence": "The secretary typed up the meeting minutes and sent them to the attendees.", "note": ""}, "crew": {"sentence": "The crew worked together to load the cargo onto the ship.", "note": ""}, "clerk": {"sentence": "The clerk processed the paperwork and filed it in the appropriate folder.", "note": ""}, "colleague": {"sentence": "The colleague provided valuable feedback on the project proposal.", "note": ""}, "consultant": {"sentence": "The consultant advised the company on how to improve their marketing strategy.", "note": ""}, "advisor": {"sentence": "The advisor gave guidance to the student on which courses to take.", "note": ""}, "counselor": {"sentence": "The counselor provided emotional support to the patient during their therapy session.", "note": ""}, "captain": {"sentence": "The captain piloted the ship through the rough waters.", "note": ""}, "staff": {"sentence": "The staff worked together to serve the customers and ensure their satisfaction.", "note": ""}, "employee": {"sentence": "The employee worked diligently to meet the daily quota.", "note": ""}, "worker": {"sentence": "The worker operated the heavy machinery to move the crates.", "note": ""}, "member": {"sentence": "The member contributed to the success of the team project.", "note": ""}, "employer": {"sentence": "The employer provided a competitive benefits package to attract top talent.", "note": ""}, "engineer": {"sentence": "The engineer designed the blueprint for the new building.", "note": ""}, "attendant": {"sentence": "The attendant assisted the passengers in finding their seats on the airplane.", "note": ""}, "janitor": {"sentence": "The janitor cleaned the floors and emptied the trash bins.", "note": ""}, "predecessor": {"sentence": "The predecessor laid the foundation for the company's success.", "note": ""}, "assistant": {"sentence": "The assistant provided administrative support to the manager.", "note": ""}, "conductor": {"sentence": "The conductor led the orchestra through the musical score.", "note": ""}, "operator": {"sentence": "The operator controlled the machinery to manufacture the products.", "note": ""}, "patron": {"sentence": "The patron made a generous donation to support the arts.", "note": ""}, "advocate": {"sentence": "The advocate spoke up for the rights of the underprivileged.", "note": ""}, "sponsorship": {"sentence": "The sponsorship from the company helped fund the charity event.", "note": ""}, "investor": {"sentence": "The investor bought shares in the company in hopes of making a profit.", "note": ""}, "stockbroker": {"sentence": "The stockbroker advised the client on which stocks to invest in.", "note": ""}, "shareholder": {"sentence": "The shareholder attended the annual shareholder meeting to vote on company matters.", "note": ""}, "landlord": {"sentence": "The landlord collected rent from the tenant every month.", "note": ""}, "tenant": {"sentence": "The tenant reported the plumbing issue to the landlord for repair.", "note": ""}, "customer": {"sentence": "The customer complained about the faulty product to the customer service representative.", "note": ""}, "guest": {"sentence": "The guest checked into the hotel and received a room key.", "note": ""}, "client": {"sentence": "The client signed a contract with the law firm to represent them in court.", "note": ""}, "recruit": {"sentence": "The recruit underwent rigorous training to become a police officer.", "note": ""}, "participant": {"sentence": "The participant actively engaged in the discussion during the conference.", "note": ""}, "expert": {"sentence": "The expert provided insights on the topic during the panel discussion.", "note": ""}, "specialist": {"sentence": "The specialist conducted a thorough examination of the patient's condition.", "note": ""}}, "l2": {"plumber": {"sentence": "The plumber came over to fix the leaky pipe in the kitchen.", "note": "456"}, "carpenter": {"sentence": "The carpenter built a beautiful bookshelf for the library.", "note": "不會"}, "tailor": {"sentence": "The tailor altered the dress to fit perfectly.", "note": ""}, "painter": {"sentence": "The painter used a palette of bright colors to create a stunning landscape painting.", "note": ""}, "repairperson": {"sentence": "The repairperson fixed the broken washing machine in no time.", "note": ""}, "surgeon": {"sentence": "The surgeon performed a successful heart transplant surgery.", "note": ""}, "photographer": {"sentence": "The photographer captured stunning portraits of the bride and groom on their wedding day.", "note": ""}, "architect": {"sentence": "The architect designed a modern and sustainable building for the city.", "note": ""}, "waiter": {"sentence": "The waiter brought us our food and drinks with a smile.", "note": ""}, "waitress": {"sentence": "The waitress took our order and made recommendations from the menu.", "note": ""}, "musician": {"sentence": "The musician played a beautiful melody on his guitar.", "note": ""}, "technician": {"sentence": "The technician fixed the broken computer and restored all the data.", "note": ""}, "artist": {"sentence": "The artist painted a mural on the side of the building.", "note": ""}, "diplomat": {"sentence": "The diplomat negotiated a peace treaty between two warring countries.", "note": ""}, "demographer": {"sentence": "The demographer studied population trends and migration patterns.", "note": ""}, "pilot": {"sentence": "The pilot safely landed the plane during a thunderstorm.", "note": ""}, "tutor": {"sentence": "The tutor helped the student with their math homework.", "note": ""}, "dentist": {"sentence": "The dentist filled a cavity and gave the patient a clean bill of oral health.", "note": ""}, "bellboy": {"sentence": "The bellboy carried our luggage to the hotel room.", "note": ""}, "scientist": {"sentence": "The scientist conducted experiments to test their hypothesis.", "note": ""}, "flight attendant": {"sentence": "The flight attendant served food and drinks to the passengers during the flight.", "note": ""}, "accountant": {"sentence": "The accountant prepared the company's financial statements for the quarter.", "note": ""}, "lawyer": {"sentence": "The lawyer represented the defendant in court and argued their case.", "note": ""}, "teller": {"sentence": "The teller helped the customer deposit a check at the bank.", "note": ""}, "housekeeper": {"sentence": "The housekeeper cleaned the hotel room and changed the sheets.", "note": ""}}}